english/vocabulary.org
#+OPTIONS: toc:1 ^:nil ~:nil num:nil reveal_title_slide:nil timestamp:nil
#+TAGS: AWL(a)

Record my english study process.
1. C represent less 1000 occur on youtube

* see
:PROPERTIES:
:EXPORT_FILE_NAME: see.md
:END:
看见另一种可能
** 语义
*** 看见
The moment we saw the house, we knew we wanted to buy it.
*** 看到
More money must be invested if we are to see an improvement in services.
*** 看得见
I can't see a thing without my glasses.
*** 查看
I'll call him and see how the job interview went.
*** 弄清楚
It will be interesting to see if he makes it into the team.
*** 参阅
See press for details.
*** 明白
I see what you mean.
*** 观看
Did you see that programme on monkeys last night?
*** 考虑
Having a child makes you see things differently.
*** 看望
I'll be seeing her tomorrow night.
*** 碰见
I saw Jane while I was out.
*** 约见
Mr Thomas is seeing a client at 2:30.
*** 与...来往
They've been seeing a lot of each other.
*** 想象
He could see a great future for her in music.
*** 确保
Please see that the lights are switched off before you leave.
*** 经历
She's seen it all before in her long career.
*** 历经
This year has seen a big increase in road accidents.
*** 陪伴
My mother used to see me across the road.
** 短语
*** see for yourself
These chocolates are *gorgeous*, Try some and see for yourself.

https://youglish.com/getbyid/81105256/see%20for%20yourself/english
*** [#C] it can be seen that
From this graph, it can be seen that some people are more susceptible to the disease.

https://youglish.com/getbyid/162154598/it%20can%20be%20seen%20that/english
*** [#C] I'll see what I can do
Leave the papers with me and I'll see what I can do.

https://youglish.com/getbyid/105846719/I'll%20see%20what%20I%20can%20do/english
*** be seeing someboty
Is she seeing anyone at the moment?

*** see something for what it is
They are unimpressed with the scheme and rightly see it for what it is.

https://youglish.com/getbyid/69528568/see%20for%20what%20it%20is/english
*** let me see
Let me see... where did I put that letter?

https://youglish.com/getbyid/77973316/let%20me%20see/english
*** I don't see why not
'Can we go to the park?' 'I don't see why not.'

https://youglish.com/getbyid/7684149/I%20don't%20see%20why%20not/english
*** [#C] be seeing things
There's no one there - you must be seeing things.

https://youglish.com/getbyid/69232554/be%20seeing%20things/english
*** [#C] have seen better days
Her hat had seen better days.

https://youglish.com/getbyid/123208164/have%20seen%20better%20days/english
*** be glad to see the back of
I'll be glad to see the back of him.

https://youglish.com/getbyid/149612522/be%20glad%20to%20see%20the%20back%20of/english
*** see the last of somebody
I thought we'd seen the last of him.

https://youglish.com/getbyid/60791138/see%20the%20last%20of/english
*** see the light
She finally saw the light and ended the relationship.

https://youglish.com/getbyid/8639562/see%20the%20light/english
*** see the light of day
This decision will ensure that the Pentagon Papers never see the light of day.

https://youglish.com/getbyid/5790017/see%20the%20light%20of%20day/english
*** see red
The thought of Pierre with Nicole had made her see red.

https://youglish.com/getbyid/77973739/see%20red/english
*** see eye to eye
We didn't exactly see eye to eye.

https://youglish.com/getbyid/81105364/see%20eye%20to%20eye/english
*** see your way to doing something
Small companies cannot see their way to taking on many trinees.

https://youglish.com/getbyid/88570074/see%20your%20way%20to/english
*** see somebody right
Just do this for me and I'll see you right.
*** not see that it matters
I can't see that it matters what I think.
